tap "homebrew/autoupdate"
tap "teamookla/speedtest"
# Library for command-line editing
brew "readline"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Command-line tool to export and inspect local iMessage database
brew "imessage-exporter"
# Pager program similar to more
brew "less"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ping Tool in Rust with Real-Time Data and Visualizations
brew "nbping"
# CLI for NextDNS's DNS-over-HTTPS (DoH)
brew "nextdns"
# Highly capable, feature-rich programming language
brew "perl"
# Vi 'workalike' with many additional features
brew "vim"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source media center
cask "stremio@beta"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "Flighty", id: 1358823008
mas "Little Snitch Mini", id: 1629008763
mas "WhatsApp", id: 310633997
uv "thefuck"
