# Taps
tap "homebrew/autoupdate"

# CLI Tools
brew "awscli"
brew "bash"
brew "bat"
brew "circleci"
brew "curl"
brew "diff-so-fancy"
brew "doctl"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "htop"
brew "imessage-exporter"
brew "jq"
brew "lefthook"
brew "less"
brew "libyaml"
brew "mas"
brew "mise"
brew "nbping"
brew "perl"
brew "readline"
brew "ripgrep"
brew "rv"
brew "starship"
brew "thefuck"
brew "tig"
brew "tlrc"
brew "vim"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "cursor"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "orbstack"
cask "protonvpn"
cask "raycast"
cask "stremio"
cask "tailscale-app"
cask "viber"
cask "zed"
cask "zoom"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "Flighty", id: 1358823008
mas "Little Snitch Mini", id: 1629008763
mas "NextDNS", id: 1464122853
mas "WhatsApp", id: 310633997

# Cursor Extensions
vscode "aaron-bond.better-comments"
vscode "alexkrechik.cucumberautocomplete"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "vsls-contrib.codetour"
vscode "william-voyek.vscode-nginx"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
