tap "homebrew/autoupdate"
# Library for command-line editing
brew "readline"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line tool for DigitalOcean
brew "doctl"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-line tool to export and inspect local iMessage database
brew "imessage-exporter"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Pager program similar to more
brew "less"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ping Tool in Rust with Real-Time Data and Visualizations
brew "nbping"
# Highly capable, feature-rich programming language
brew "perl"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby version manager
brew "rv"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Vi 'workalike' with many additional features
brew "vim"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Replacement for Docker Desktop
cask "orbstack"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source media center
cask "stremio@beta"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Calling and messaging application focusing on security
cask "viber"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "Flighty", id: 1358823008
mas "Little Snitch Mini", id: 1629008763
mas "NextDNS", id: 1464122853
mas "WhatsApp", id: 310633997
